<?php


return [

    /*
    |--------------------------------------------------------------------------
    | Pagination Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used by the paginator library to build
    | the simple pagination links. You are free to change them to anything
    | you want to customize your views to better match your application.
    |
    */

    /**
     * 按模块区分不同状态码和返回信息码
     */
    '402' => '请先实名认证',

    // 用户模块，1开头
    '10001' => '用户已存在',
    '10002' => '推荐人不存在',
    '10003' => '用户不存在',
    '10004' => '登录失败，请检查用户名或密码',
    '10005' => '注册失败',
    '10006' => '注册成功',
    '10008' => '原始密码错误',
    '10009' => '密码修改失败',
    '10010' => '密码修改成功',
    '10011' => '重复签到',
    '10012' => '签到失败',
    '10013' => '签到成功',
    '10014' => '推荐码错误',
    '10015' => '授权登录，未绑定账号',
    '10016' => '登录成功',
    '10017' => '新手机号已被注册',
    '10018' => '推荐人未实名',

    '10020' => '验证码发送成功',
    '10021' => '请重新发送验证码',
    '10022' => '验证码校验失败',
    '10023' => '验证码发送失败',
    '10024' => '验证码错误次数过多，请重新获取',
    '10025' => '验证码缓存失败:01',


    // 全局
    '80001' => '网络错误,请稍后再试',
    '80002' => '签名未通过',
    '80003' => 'Token验证失败',
    '80004' => '数据未找到',
    '80005' => '请勿重复点击',
    '80006' => '参数错误',
    '80007' => '您无权操作',
];
